pzy25/Longxin_competition/STM32 freeRTOS/FREEMODBUS/FREEMODBUS/port/porttcp.c
#include "stm32f10x.h"
#include <stdio.h>
#include "port.h"

/* ----------------------- Modbus includes ----------------------------------*/
#include "mb.h"
#include "mbport.h"
/*----------------------------W5500-------------------------------------------*/
#include "socket.h"
#include "string.h"

/* ----------------------- MBAP Header --------------------------------------*/
#define MB_TCP_UID          6
#define MB_TCP_LEN          4
#define MB_TCP_FUNC         7


/* ----------------------- Defines  -----------------------------------------*/

extern uint8_t ucTCPRequestFrame[MB_TCP_BUF_SIZE];
extern uint16_t ucTCPRequestLen;
extern uint8_t  ucTCPResponseFrame[MB_TCP_BUF_SIZE];
extern uint16_t ucTCPResponslen;
extern uint8_t bFrameSent;

extern void xMBUtilSetBits( UCHAR * ucByteBuf, USHORT usBitOffset, UCHAR ucNBits,UCHAR ucValue );
extern UCHAR xMBUtilGetBits( UCHAR * ucByteBuf, USHORT usBitOffset, UCHAR ucNBits );

//初始化socket连接
BOOL
xMBTCPPortInit( USHORT usTCPPort )
{
	
    SOCKET sn;
    sn=0;
    if(getSn_SR(sn)==SOCK_CLOSED)
    {
			printf("Tcp Sever Start!\r\n");
       
			socket(sn,Sn_MR_TCP,usTCPPort,0x00);   //打开socket
			
			printf("socket 0 open success.\r\n");
    }
    if (getSn_SR(sn)==SOCK_INIT)
    {
     listen(sn);
		 printf("socket 0 listening .\r\n");
     return TRUE;
    }
    return FALSE;
}



BOOL xMBTCPPortGetRequest(UCHAR **ppucMBTCPFrame,USHORT *usTCPLength)
{
	  *ppucMBTCPFrame = (uint8_t *) &ucTCPRequestFrame[0];  
    *usTCPLength = ucTCPRequestLen;    
    /* Reset the buffer. */  
    ucTCPRequestLen = 0;  
    return TRUE; 

}




//发送数据
BOOL
xMBTCPPortSendResponse( const UCHAR * pucMBTCPFrame, USHORT usTCPLength )
{
		memcpy(ucTCPResponseFrame,pucMBTCPFrame,usTCPLength);
		ucTCPResponslen = usTCPLength;
		bFrameSent = TRUE;
		return bFrameSent;
}

void vMBTCPPortClose(void)
{
	
}

void vMBTCPPortDisable(void)
{

}


//输入寄存器内容
uint16_t usRegInputBuf[REG_INPUT_NREGS] = {0};
//保持寄存器内容               
uint16_t usRegHoldingBuf[REG_HOLDING_NREGS] = {0};                                       
//线圈状态
uint8_t ucRegCoilsBuf[REG_COILS_SIZE] = {0};
//离散寄存器内容
uint8_t ucRegDiscreteBuf[REG_DISCRETE_SIZE] = {0};


/****************************************************************************
* 名          称：eMBRegInputCB
* 功    能：读取输入寄存器，对应功能码是 04 eMBFuncReadInputRegister
* 入口参数：pucRegBuffer: 数据缓存区，用于响应主机   
*                                                usAddress: 寄存器地址
*                                                usNRegs: 要读取的寄存器个数
* 出口参数：
* 注          意：上位机发来的 帧格式是: SlaveAddr(1 Byte)+FuncCode(1 Byte)
*                                                                +StartAddrHiByte(1 Byte)+StartAddrLoByte(1 Byte)
*                                                                +LenAddrHiByte(1 Byte)+LenAddrLoByte(1 Byte)+
*                                                                +CRCAddrHiByte(1 Byte)+CRCAddrLoByte(1 Byte)
*                                                        3 区
****************************************************************************/
eMBErrorCode eMBRegInputCB(UCHAR * pucRegBuffer, USHORT usAddress, USHORT usNRegs )
{
    eMBErrorCode    eStatus = MB_ENOERR;
    USHORT          iRegIndex;


    if ((usAddress >= REG_INPUT_START) && (usAddress + usNRegs <= REG_INPUT_START + REG_INPUT_NREGS))
    {
        iRegIndex = usAddress - REG_INPUT_START;
        while (usNRegs > 0)
        {
            *pucRegBuffer++ = (UCHAR) (usRegInputBuf[iRegIndex] >> 8);
            *pucRegBuffer++ = (UCHAR) (usRegInputBuf[iRegIndex] & 0xFF);
            iRegIndex++;
            usNRegs--;
        }
    }
    else
    {
        eStatus = MB_ENOREG;
    }

    return eStatus;
}

/****************************************************************************
* 名          称：eMBRegHoldingCB
* 功    能：对应功能码有：06 写保持寄存器 eMBFuncWriteHoldingRegister
*                                                                                                        16 写多个保持寄存器 eMBFuncWriteMultipleHoldingRegister
*                                                                                                        03 读保持寄存器 eMBFuncReadHoldingRegister
*                                                                                                        23 读写多个保持寄存器 eMBFuncReadWriteMultipleHoldingRegister
* 入口参数：pucRegBuffer: 数据缓存区，用于响应主机   
*                                                usAddress: 寄存器地址
*                                                usNRegs: 要读写的寄存器个数
*                                                eMode: 功能码
* 出口参数：
* 注          意：4 区
****************************************************************************/
eMBErrorCode
eMBRegHoldingCB( UCHAR * pucRegBuffer, USHORT usAddress, USHORT usNRegs, eMBRegisterMode eMode )
{
        eMBErrorCode    eStatus = MB_ENOERR;
        int             iRegIndex;


        if((usAddress >= REG_HOLDING_START)&&((usAddress+usNRegs) <= (REG_HOLDING_START + REG_HOLDING_NREGS)))
        {
                iRegIndex = (int)(usAddress - REG_HOLDING_START);
                switch(eMode)
                {                                       
                        case MB_REG_READ://读 MB_REG_READ = 0
                                while(usNRegs > 0)
                                {
                                        *pucRegBuffer++ = (u8)(usRegHoldingBuf[iRegIndex] >> 8);            
                                        *pucRegBuffer++ = (u8)(usRegHoldingBuf[iRegIndex] & 0xFF);
                                        iRegIndex++;
                                        usNRegs--;                                       
                                }                           
                        break;
                        case MB_REG_WRITE://写 MB_REG_WRITE = 0
                                while(usNRegs > 0)
                                {         
                                        usRegHoldingBuf[iRegIndex] = *pucRegBuffer++ << 8;
                                        usRegHoldingBuf[iRegIndex] |= *pucRegBuffer++;
                                        iRegIndex++;
                                        usNRegs--;
                                }
                        break;                                
                }
        }
        else//错误
        {
                eStatus = MB_ENOREG;
        }        
        
        return eStatus;
}



/****************************************************************************
* 名          称：eMBRegCoilsCB
* 功    能：对应功能码有：01 读线圈 eMBFuncReadCoils
*                                                  05 写线圈 eMBFuncWriteCoil
*                                                  15 写多个线圈 eMBFuncWriteMultipleCoils
* 入口参数：pucRegBuffer: 数据缓存区，用于响应主机   
*                                                usAddress: 线圈地址
*                                                usNCoils: 要读写的线圈个数
*                                                eMode: 功能码
* 出口参数：
* 注          意：如继电器
*                                                0 区
****************************************************************************/
eMBErrorCode eMBRegCoilsCB( UCHAR * pucRegBuffer, USHORT usAddress, USHORT usNCoils,
              eMBRegisterMode eMode )
{
  //错误状态
  eMBErrorCode eStatus = MB_ENOERR;
  //寄存器个数
  int16_t iNCoils = ( int16_t )usNCoils;
  //寄存器偏移量
  int16_t usBitOffset;
  
  //检查寄存器是否在指定范围内
  if( ( (int16_t)usAddress >= REG_COILS_START ) && ( usAddress + usNCoils <= REG_COILS_START + REG_COILS_SIZE ) )
  {
    //计算寄存器偏移量
    usBitOffset = ( int16_t )( usAddress - REG_COILS_START );
    switch ( eMode )
    {
      //读操作
    case MB_REG_READ:
      while( iNCoils > 0 )
      {
        *pucRegBuffer++ = xMBUtilGetBits( ucRegCoilsBuf, usBitOffset,
                                         ( uint8_t )( iNCoils > 8 ? 8 : iNCoils ) );
        iNCoils -= 8;
        usBitOffset += 8;
      }
      break;
      
      //写操作
    case MB_REG_WRITE:
      while( iNCoils > 0 )
      {
        xMBUtilSetBits( ucRegCoilsBuf, usBitOffset,
                       ( uint8_t )( iNCoils > 8 ? 8 : iNCoils ),
                       *pucRegBuffer++ );
        iNCoils -= 8;
      }
      break;
    }
    
  }
  else
  {
    eStatus = MB_ENOREG;
  }
  return eStatus;
}
/****************************************************************************
* 名          称：eMBRegDiscreteCB
* 功    能：读取离散寄存器，对应功能码有：02 读离散寄存器 eMBFuncReadDiscreteInputs
* 入口参数：pucRegBuffer: 数据缓存区，用于响应主机   
*                                                usAddress: 寄存器地址
*                                                usNDiscrete: 要读取的寄存器个数
* 出口参数：
* 注          意：1 区
****************************************************************************/
eMBErrorCode
eMBRegDiscreteCB( UCHAR * pucRegBuffer, USHORT usAddress, USHORT usNDiscrete )
{
        eMBErrorCode    eStatus = MB_ENOERR;
        int             iRegIndex;
        u8 i;
        USHORT readNumber=usNDiscrete;
        USHORT coilValue=0x0000;
        iRegIndex = (int)(usAddress + usNDiscrete-REG_DISCRETE_START);
        if((usAddress >= REG_DISCRETE_START)&&\
        ((usAddress+usNDiscrete) <= (REG_DISCRETE_START + REG_DISCRETE_SIZE)))
        {
                for(i=0;i<usNDiscrete;i++)
                {
                        readNumber--;
                        iRegIndex--;
                        coilValue|=ucRegDiscreteBuf[iRegIndex]<<readNumber;
                }
                if(usNDiscrete<=8)
                {
                        * pucRegBuffer=coilValue;
                }
                else
                {
                        * pucRegBuffer++ = (coilValue)&0x00ff;
                        * pucRegBuffer++ = (coilValue>>8)&0x00ff;
                }
        }
        else
        {
                eStatus = MB_ENOREG;
        }
    return eStatus;
}

